app/controllers/sponsors_controller.rb

  def create
    @sponsor = Sponsor.new(sponsor_params)
    if @sponsor.save
---
INSERT INTO "sponsors" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Paloma Blanca"], ["email", "hello@gmail.com"], ["phone", "2102846864"], ["created_at", 2017-03-18 05:42:32 UTC], ["updated_at", 2017-03-18 05:42:32 UTC]]