app/controllers/users_controller.rb

  def show_sponsors
    @sponsors = Sponsor.all
---
SELECT "sponsors".* FROM "sponsors" ORDER BY created_at